{"pages":[{"title":"404 Not Found","text":"","link":"/404.html"}],"posts":[{"title":"大数据技术综述","text":"本文为对2014年的大数据技术综述论文《Big Data: A Survey》的翻译，论文作者为 Min Chen、Shiwen Mao和Yunhao Liu 英文版论文地址 Big Data: A Survey. 摘要在本文中，我们回顾了大数据的背景和最新技术。 我们首先介绍了大数据的一般背景，并回顾了相关技术， 如云计算、物联网、数据中心和Hadoop。 然后我们聚焦于大数据价值链的四个阶段，即数据生成、数据获取、数据存储和数据分析。 对于每个阶段，我们都会介绍一般背景、讨论技术挑战并回顾最新进展。 最后，我们研究了大数据的几个代表性应用， 包括企业管理、物联网、在线社交网络、医疗应用、集体智能和智能电网。 这些讨论旨在为读者提供这个令人兴奋的领域的一个全面的和宏观的概述。 本次综述以对开放问题和未来方向的讨论结束。 背景大数据时代的黎明在过去的20年里，各个领域的数据都有了大规模的增长。根据国际数据公司（International Data Corporation, IDC）的报告， 2011年全球创建和复制的数据总量为1.8ZB（约为$10^{21}$字节），在五年内增长了近9倍1。 未来，这个数字至少每两年就会翻一番。 在全球数据的爆炸式增长的背景下，大数据一词主要用于描述庞大的数据集。与传统数据集相比，大数据通常包含大量需要实时处理的非结构化数据。 大数据给予了我们发现数据背后隐藏价值的机遇，也带来了新的挑战，比如，如何高效的组织和管理大规模的数据。 最近，行业对大数据的巨大潜力产生了兴趣，许多政府机构宣布了加快大数据研究和应用的重大计划2。 此外，大数据问题经常被 公共媒体报道，如经济学人3,4、纽约时报5国家公共广播电台6,7。两大顶级科学期刊 Nature和Science也开设了专栏，讨论大数据的挑战和影响8,9。毋庸置疑，大数据时代已经来临。 如今，与互联网公司服务相关的大数据增长迅速。例如，谷歌处理数百个PB的数据， Facebook每月产生超过10pb的日志数据，百度处理数十个PB的数据， 阿里巴巴旗下的淘宝每天产生数十个TB的在线交易数据。图1展示了全球数据量的增长。 大型数据集的数量急剧增加的同时，也带来了许多具有亟待解决的富有挑战性的问题: 信息技术 (IT) 的最新进展使生成数据变得更加容易。 例如，平均每分钟有 72 小时的视频上传到 YouTube11。 因此，我们面临的主要挑战之一是从广泛分布的数据源收集和整合海量数据。 云计算和物联网的快速发展进一步推动了数据的急剧增长。云计算为数据资产提供了保障、访问场所和渠道。 在物联网的范式中，世界各地的传感器都在收集和传输数据，并在云中存储和处理。这样的数据无论在数量上还是相互关系上都将远远超过现有企业的IT架构和基础设施的能力， 日益增长的数据带来的另一个问题是，在硬件和软件基础设施有限的情况下，如何存储和管理如此庞大的异构数据集。 考虑到大数据的异构性、可扩展性、实时性、复杂性和私密性等特点，在分析、建模、可视化和预测等过程中， 需要对不同层次的数据集进行有效的“挖掘”，以揭示其内在属性，提高决策能力。 持续更新中... 大数据的定义和特点大数据的价值大数据的发展历史大数据的挑战相关技术大数据与云计算的关系大数据与IoT的关系数据中心大数据与hadoop的关系大数据的生成和获取大数据的存储大数据的应用结论、有待解决的问题和展望参考文献见原论文。","link":"/pages/big-data-survey/"},{"title":"不知道做啥？看下那些真实业务场景下的技术问题","text":"(云计算) 如何解决Serverless函数冷启动的问题？ (智能运维) 如何对业务指标和基础监控指标做异常检测？","link":"/pages/problems/"},{"title":"(云计算) 如何解决Serverless函数冷启动的问题？","text":"背景 如果你的PaaS能够有效地在20毫秒内启动实例并运行半秒,那么就可以称之为Serverless。 —— AWS云架构战略副总裁Adrian Cockcroft1 Serverless的最大卖点之一就是在做弹性伸缩时可以将实例数缩到0，没流量时不花钱，有流量来时再扩容。然而理想很丰满，现实很骨感。 无论是在流量刚到达时实例数从0到1，还是为了处理更多的流量将实例数从m扩到n的过程，不得不面对的一个问题就是：冷启动。冷启动时间太长， 就会出现请求超时。 何为冷启动 冷启动是指在函数调用链路中包含了资源调度、镜像/代码下载、启动容器、运行时初始化、用户代码初始化等环节。当冷启动完成后，函数实例就绪， 后续请求就能直接被函数执行2。 传统的优化方案尽量避免冷启动 某个实例处理完请求后，不会因为后面2，3分钟没流量就被销毁。各个厂商都会让其继续存在一段时间，比如30分钟。 预热 Amazon EventBridge。搞个定时任务定时去触发Lambda实例，比如每5分钟触发一次3。 “这样在真正想要处理的事件抵达之前，就会有已经被预热 Lambda 保持激活状态以等待响应”。这种方法也可以用来处理在出现时间上具有规律的流量高峰。 预置并发。”预置并发是 AWS Lambda 在 2019 年推出的一个功能，该功能能够指定处于激活状态的 Lambda 实例数量，使函数保持初始化状态”。 在k8s就是相当于给HPA设定个最小副本数呗3。 除了浪费资源，上面的策略也无法解决突发流量场景下从m扩到n时的冷启动问题。 调度 （腾讯）降低调度复杂度4。 原有的调度模块需要考虑的维度很多： 数十种虚拟机的配置、CPU/内存/存储/网络等亲和性和反亲和性、 部署组的需求-跨宿主机，交换机，机架、资源利用率、碎片填充...... 轻量化调度模块：少数的虚拟机配置、宿主机的可用资源离线计算 容器启动 （腾讯）轻量级虚拟机4。 网络 （腾讯）SCF网络4 镜像/代码下载 （平台侧）代码缓存4。 （用户侧）既然代码下载耗时，那你尽可能减小代码包的大小吧。比如在程序中移除不必要的代码、减少不必要的第三方库依赖等。 运行时初始化 如果是用Java, 可以禁掉JVM的分层编译以降低运行速度的代价来换取启动速度的提升3。 其它优化方案WebAssembly WebAssembly 与 Kubernetes 双剑合璧：机遇与挑战 云原生的 WebAssembly 能取代 Docker 吗？ IsolatesCloudFlare的方案 Cloud Computing without Containers 其Serverless平台Workers已宣称零冷启动时间。 Say goodbye to cold starts—support for 0ms worldwide 各个厂商的冷启动时延? 参考链接 AWS 从IaaS到FaaS—— Serverless架构的前世今生 美团 Serverless平台Nest的探索与实践 亚马逊 降低AWS Lambda 冷启动时间的4种方案 腾讯云 Go FaaSter ：Serverless平台冷启动优化 持续更新中...","link":"/pages/serverless-coldstart/"},{"title":"(智能运维) 如何对业务指标和基础监控指标做异常检测？","text":"背景参考链接 腾讯 织云Metis时间序列异常检测全方位解析 美团 外卖订单量预测异常报警模型实践 滴滴 滴滴出行海量数据场景下的智能监控与故障定位实践 有空就更新...","link":"/pages/ts-anomaly-detection/"}],"tags":[{"name":"大数据","slug":"大数据","link":"/tags/%E5%A4%A7%E6%95%B0%E6%8D%AE/"},{"name":"综述","slug":"综述","link":"/tags/%E7%BB%BC%E8%BF%B0/"},{"name":"智能运维","slug":"智能运维","link":"/tags/%E6%99%BA%E8%83%BD%E8%BF%90%E7%BB%B4/"},{"name":"业务场景","slug":"业务场景","link":"/tags/%E4%B8%9A%E5%8A%A1%E5%9C%BA%E6%99%AF/"},{"name":"Serverless","slug":"Serverless","link":"/tags/Serverless/"}],"categories":[{"name":"大数据","slug":"大数据","link":"/categories/%E5%A4%A7%E6%95%B0%E6%8D%AE/"},{"name":"智能运维","slug":"智能运维","link":"/categories/%E6%99%BA%E8%83%BD%E8%BF%90%E7%BB%B4/"},{"name":"Serverless","slug":"Serverless","link":"/categories/Serverless/"}]}